20201105
第一章 引论
    1. 数学知识复习
        1. 几个常见级数公式
            调和数是什么
        2. 模运算
            A≡B（mod n）称为A与B模n同余
            即A-B可以被n整除
        3. 证明方法
            归纳法
                1. 基准情形
                2. 归纳假设
                3. 归纳推理
            举反例
            反证法
    2. 递归简论
        1. 递归方法原则
            1. 基准情形
            2. 不断推进
            3. 设计法则，每个递归都能运行
            4. 合成效益，考虑效率。
        2. 几个递归的例子
            1. 实现一个递归函数F(0)=0, F(X)=2F(X-1)+X^2;
            2. 用只能打印单个数字的函数用递归构建一个函数打印一串整数













